---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarInSystem.RebarShapeId
source: html/c1687ed1-98dd-2c0f-ec09-09e8e79b929d.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.RebarShapeId Property

The RebarShape element that defines the shape of the rebar.

## Syntax (C#)
```csharp
public ElementId RebarShapeId { get; }
```